app/Http/Controllers/HomeController.php

    public function index()
    {
        // Mengambil produk-produk untuk ditampilkan di landing page
        $produk = Produk::withCount('detailPesanan')
                ->orderBy('detail_pesanan_count', 'desc')
                ->take(8)
                ->get();

        // Mengambil ulasan-ulasan terbaru untuk ditampilkan di landing page
        $ulasan = Ulasan::with(['user', 'produk'])
                    ->latest()
                    ->take(3)
                    ->get();
---
select count(*) as aggregate from `produk` where `produk`.`deleted_at` is null
select * from `ulasan` order by `created_at` desc limit 4
select * from `users` where `users`.`id` in (2, 3, 4)

    public function produk(Request $request)
    {
        // Inisialisasi query builder
        $query = Produk::query();

        // Filter berdasarkan parameter GET jika ada
        if ($request->has('sort')) {
            if ($request->sort === 'popularity') {
                $query->withCount('detailPesanan')->orderBy('detail_pesanan_count', 'desc');
            } elseif ($request->sort === 'price_low') {
                $query->orderBy('harga', 'asc');
            } elseif ($request->sort === 'price_high') {
                $query->orderBy('harga', 'desc');
            } else {
                $query->latest();
            }
        } else {
            $query->latest();
        }

        // Mengambil semua produk untuk halaman produk
        $produk = $query->paginate(12)->withQueryString();

        // Tambahkan data order_count untuk setiap produk
        $produk->each(function ($item) {
            $item->order_count = $item->detailPesanan()->count();
        });

        // Mengambil semua jenis ikan unik dari database
        $jenisIkan = Produk::distinct('jenis_ikan')
                    ->whereNotNull('jenis_ikan')
                    ->pluck('jenis_ikan')
                    ->filter()
                    ->unique()
                    ->values()
                    ->all();
---
select * from `produk` where `produk`.`deleted_at` is null order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `produk` where `produk`.`deleted_at` is null
select distinct `jenis_ikan` from `produk` where `jenis_ikan` is not null and `produk`.`deleted_at` is null

    public function detailProduk($id)
    {
        // Mengambil detail produk berdasarkan ID
        $produk = Produk::findOrFail($id);

        // Mengambil ulasan untuk produk ini
        $ulasan = Ulasan::where('id_Produk', $id)
                    ->with('user')
                    ->latest()
                    ->get();

        // Menghitung rating rata-rata
        $avgRating = $ulasan->avg('rating');

        // Inisialisasi variabel untuk user yang sudah login
        $userHasPurchased = false;
        $userHasReviewed = false;

        // Cek apakah user sudah login
        if (Auth::check()) {
            $userId = Auth::id();

            // Cek apakah user sudah membeli produk ini
            $userHasPurchased = \App\Models\DetailPesanan::whereHas('pesanan', function($query) use ($userId) {
                $query->where('user_id', $userId)->whereIn('status_pesanan', ['selesai', 'dikirim']);
            })->where('id_Produk', $id)->exists();

            // Cek apakah user sudah memberikan ulasan
            $userHasReviewed = Ulasan::where('user_id', $userId)
                                ->where('id_Produk', $id)
                                ->exists();
        }

        // Produk terkait - produk dengan jenis yang sama
        $relatedProducts = Produk::where('jenis_ikan', $produk->jenis_ikan)
                            ->where('id_Produk', '!=', $id)
                            ->take(4)
                            ->get();
---
select * from `produk` where `produk`.`id_Produk` = '9' and `produk`.`deleted_at` is null limit 1
select * from `ulasan` where `id_Produk` = '9' order by `created_at` desc
select exists(select * from `detail_pesanan` where exists (select * from `pesanan` where `detail_pesanan`.`id_pesanan` = `pesanan`.`id_pesanan` and `user_id` = 5 and `status_pesanan` in ('selesai', 'dikirim')) and `id_Produk` = '9') as `exists`
select exists(select * from `ulasan` where `user_id` = 5 and `id_Produk` = '9') as `exists`
select * from `produk` where `jenis_ikan` = 'Koi' and `id_Produk` != '9' and `produk`.`deleted_at` is null limit 4