app/Http/Controllers/HomeController.php

select * from `produk` where `produk`.`deleted_at` is null order by `created_at` desc limit 8
---
    public function index()
    {
        // Mengambil produk-produk untuk ditampilkan di landing page
        $produk = Produk::latest()->take(8)->get();

select * from `produk` where `produk`.`deleted_at` is null order by `created_at` desc limit 12 offset 0
---
    public function produk()
    {
        // Mengambil semua produk untuk halaman produk
        $produk = Produk::latest()->paginate(12);

select * from `produk` where `produk`.`id_Produk` = '2' and `produk`.`deleted_at` is null limit 1
select * from `ulasan` where `id_Produk` = '2' order by `created_at` desc
select * from `users` where `users`.`id` in (2)
---
    public function detailProduk($id)
    {
        // Mengambil detail produk berdasarkan ID
        $produk = Produk::findOrFail($id);

        // Mengambil ulasan untuk produk ini
        $ulasan = Ulasan::where('id_Produk', $id)
                    ->with('user')
                    ->latest()
                    ->get();