app/Http/Controllers/KeranjangController.php

    public function getCartCount()
    {
        if (!Auth::check()) {
            return response()->json(['count' => 0]);
        }

        $count = Keranjang::where('user_id', Auth::id())->sum('jumlah');
---
select sum(`jumlah`) as aggregate from `keranjang` where `user_id` = 9