app/Http/Controllers/KeranjangController.php

    public function update(Request $request, string $id)
    {
        $request->validate([
            'jumlah' => 'required|integer|min:1|max:999',
        ]);

        $keranjang = Keranjang::findOrFail($id);

        // Cek kepemilikan
        if ($keranjang->user_id != Auth::id()) {
            return redirect()->route('keranjang.index')->with('error', 'Anda tidak memiliki akses');
        }

        // Ambil data produk
        $produk = Produk::findOrFail($keranjang->id_Produk);

        // Cek stok
        if ($produk->stok < $request->jumlah) {
            return redirect()->back()->with('error', 'Stok tidak mencukupi, stok tersedia: ' . $produk->stok);
        }

        // Update jumlah dan total harga
        $keranjang->jumlah = $request->jumlah;
        $keranjang->total_harga = $request->jumlah * $produk->harga;
        $keranjang->save();

        return redirect()->route('keranjang.index')->with('success', 'Keranjang berhasil diperbarui');
---
select sum(`jumlah`) as aggregate from `keranjang` where `user_id` = 5

    public function destroyViaPost(string $id)
    {
    $keranjang = Keranjang::findOrFail($id);

    // Cek kepemilikan
    if ($keranjang->user_id != Auth::id()) {
        if (request()->ajax() || request()->wantsJson()) {
            return response()->json(['success' => false, 'message' => 'Anda tidak memiliki akses'], 403);
        }
        return redirect()->route('keranjang.index')->with('error', 'Anda tidak memiliki akses');
    }

    // Hapus item dari keranjang
    $keranjang->delete();
---
delete from `keranjang` where `id_keranjang` = 26

    public function getCartCount()
    {
        if (!Auth::check()) {
            return response()->json(['count' => 0]);
        }

        $count = Keranjang::where('user_id', Auth::id())->sum('jumlah');
---
select sum(`jumlah`) as aggregate from `keranjang` where `user_id` = 5