app/Http/Controllers/KeranjangController.php

select * from `keranjang` where `user_id` = 7
---
    public function index()
    {
        // Mengambil keranjang belanja milik user yang sedang login
        $keranjang = Keranjang::where('user_id', Auth::id())
                    ->with('produk')
                    ->get();

select * from `keranjang` where `user_id` = 7 and `id_Produk` = '1' limit 1
---
    public function addToCart(Request $request)
    {
        // Validasi input
        $request->validate([
            'product_id' => 'required|exists:produk,id_Produk',
            'quantity' => 'required|integer|min:1',
        ]);

        // Ambil data produk
        $produk = Produk::findOrFail($request->product_id);

        // Cek stok
        if ($produk->stok < $request->quantity) {
            if ($request->ajax() || $request->wantsJson()) {
                return response()->json([
                    'success' => false,
                    'message' => 'Stok tidak mencukupi'
                ]);
            }
            return redirect()->back()->with('error', 'Stok tidak mencukupi');
        }

        // Cek apakah produk sudah ada di keranjang
        $keranjang = Keranjang::where('user_id', Auth::id())
                   ->where('id_Produk', $request->product_id)
                   ->first();

update `keranjang` set `jumlah` = 5, `total_harga` = 100000, `keranjang`.`updated_at` = '2025-04-21 23:23:12' where `id_keranjang` = 10
insert into `keranjang` (`user_id`, `id_Produk`, `jumlah`, `total_harga`, `updated_at`, `created_at`) values (7, '1', '1', 30000, '2025-04-30 15:26:39', '2025-04-30 15:26:39')
---
        if ($keranjang) {
            $keranjang->jumlah += $request->quantity;
            $keranjang->total_harga = $keranjang->jumlah * $produk->harga;
            $keranjang->save();
        } else {
            // Jika belum ada, buat baru
            Keranjang::create([
                'user_id' => Auth::id(),
                'id_Produk' => $request->product_id,
                'jumlah' => $request->quantity,
                'total_harga' => $request->quantity * $produk->harga,
            ]);

select * from `produk` where `produk`.`id_Produk` = 1 and `produk`.`deleted_at` is null limit 1
---
    public function update(Request $request, string $id)
    {
        $request->validate([
            'jumlah' => 'required|integer|min:1|max:999',
        ]);

        $keranjang = Keranjang::findOrFail($id);

        // Cek kepemilikan
        if ($keranjang->user_id != Auth::id()) {
            return redirect()->route('keranjang.index')->with('error', 'Anda tidak memiliki akses');
        }

        // Ambil data produk
        $produk = Produk::findOrFail($keranjang->id_Produk);

select * from `produk` where `produk`.`id_Produk` = 3 and `produk`.`deleted_at` is null limit 1
update `keranjang` set `jumlah` = '1', `total_harga` = 75000, `keranjang`.`updated_at` = '2025-04-30 12:37:08' where `id_keranjang` = 8
---
    public function updateViaPost(Request $request, string $id)
    {
        $request->validate([
            'jumlah' => 'required|integer|min:1|max:999',
        ]);

        $keranjang = Keranjang::findOrFail($id);

        // Cek kepemilikan
        if ($keranjang->user_id != Auth::id()) {
            return response()->json(['success' => false, 'message' => 'Anda tidak memiliki akses'], 403);
        }

        // Ambil data produk
        $produk = Produk::findOrFail($keranjang->id_Produk);

        // Cek stok
        if ($produk->stok < $request->jumlah) {
            return response()->json(
                ['success' => false, 'message' => 'Stok tidak mencukupi, stok tersedia: ' . $produk->stok],
                400
            );
        }

        // Update jumlah dan total harga
        $keranjang->jumlah = $request->jumlah;
        $keranjang->total_harga = $request->jumlah * $produk->harga;
        $keranjang->save();

select * from `keranjang` where `keranjang`.`id_keranjang` = '34' limit 1
---
    public function bulkDelete(Request $request)
    {
        $request->validate([
            'selected_items' => 'required|array',
            'selected_items.*' => 'exists:keranjang,id_keranjang',
        ]);

        // Delete only items that belong to the authenticated user
        $deleted = Keranjang::whereIn('id_keranjang', $request->selected_items)
            ->where('user_id', Auth::id())
            ->delete();

        if ($deleted > 0) {
            return redirect()->route('keranjang.index')
                ->with('success', $deleted . ' produk berhasil dihapus dari keranjang');