app/Http/Controllers/NotificationController.php

    public function getUnreadCount()
    {
        // Check if user is authenticated
        if (!Auth::check()) {
            return response()->json(['count' => 0]);
        }

        try {
            $user = Auth::user();
            $isAdmin = $user->is_admin ?? false;

            $count = Notification::where('user_id', $user->id)
                ->where('for_admin', $isAdmin)
                ->where('is_read', false)
                ->count();
---
select count(*) as aggregate from `notifications` where `user_id` = 1 and `for_admin` = 1 and `is_read` = 0