app/Http/Controllers/NotificationController.php

select * from `notifications` where `user_id` = 5 and `for_admin` = 0 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `notifications` where `user_id` = 1 and `for_admin` = 1
---
    public function index()
    {
        // Check if user is authenticated
        if (!Auth::check()) {
            if (request()->wantsJson() || request()->has('format') && request('format') === 'json') {
                return response()->json(['error' => 'Unauthenticated'], 401);
            }
            return redirect()->route('login');
        }

        $user = Auth::user();
        $isAdmin = $user->is_admin ?? false;

        try {
            // For API requests, check if specific admin/customer filter is provided
            $forAdmin = $isAdmin;
            if (request()->has('for_admin')) {
                $forAdmin = request('for_admin') == 1;
            }

            // Get notifications appropriate for the user type (admin or customer)
            $notifications = Notification::where('user_id', $user->id)
                ->where('for_admin', $forAdmin)
                ->orderBy('created_at', 'desc')
                ->paginate(10);

update `notifications` set `is_read` = 1, `notifications`.`updated_at` = '2025-05-11 06:51:20' where `user_id` = 5 and `for_admin` = 0 and `is_read` = 0
---
    public function markAllAsRead()
    {
        // Check if user is authenticated
        if (!Auth::check()) {
            if (request()->ajax()) {
                return response()->json(['error' => 'Unauthenticated'], 401);
            }
            return redirect()->route('login');
        }

        try {
            $user = Auth::user();

            Notification::where('user_id', $user->id)
                ->where('for_admin', $user->is_admin ?? false)
                ->where('is_read', false)
                ->update(['is_read' => true]);

select count(*) as aggregate from `notifications` where `user_id` = 5 and `for_admin` = 0 and `is_read` = 0
---
    public function getUnreadCount()
    {
        // Check if user is authenticated
        if (!Auth::check()) {
            return response()->json(['count' => 0]);
        }

        try {
            $user = Auth::user();
            $isAdmin = $user->is_admin ?? false;

            // For API requests, check if specific admin/customer filter is provided
            $forAdmin = $isAdmin;
            if (request()->has('for_admin')) {
                $forAdmin = request('for_admin') == 1;
            }

            $count = Notification::where('user_id', $user->id)
                ->where('for_admin', $forAdmin)
                ->where('is_read', false)
                ->count();