app/Http/Controllers/Admin/ProdukController.php

    public function destroy(string $id)
    {
        $produk = Produk::findOrFail($id);
        $produk->delete(); // Soft delete

        return redirect()->route('admin.produk.index')
                ->with('success', 'Produk berhasil dihapus (soft delete)');
---
select * from `produk` where `produk`.`id_Produk` = '1' limit 1