app/Http/Controllers/Admin/ProdukController.php

select * from `produk` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `produk`
---
    public function index()
    {
        // Mengambil semua produk termasuk yang di-soft delete
        $produk = Produk::withTrashed()->latest()->paginate(10);

select * from `produk` where `produk`.`id_Produk` = '9' and `produk`.`deleted_at` is null limit 1
---
    public function destroy(string $id)
    {
        $produk = Produk::findOrFail($id);
        $produk->delete(); // Soft delete

        return redirect()->route('admin.produk.index')
                ->with('success', 'Produk berhasil dihapus (soft delete)');